app/controllers/home_controller.rb

INSERT INTO `users` (`authentication_token`, `birthday`, `city`, `created_at`, `email`, `first_name`, `hashed_password`, `last_name`, `password_expires_after`, `password_reset_token`, `phone`, `phone_type`, `salt`, `state`, `street`, `updated_at`, `zip`) VALUES (NULL, NULL, NULL, '2014-05-26 10:19:33', NULL, NULL, '$2a$10$KQ9JLpjD3t1ZR6gnQp4L1e5YvXhLVFfu/fDMixMuSovKHTnQIy2nK', NULL, NULL, NULL, NULL, NULL, '$2a$10$KQ9JLpjD3t1ZR6gnQp4L1e', NULL, NULL, '2014-05-26 10:19:33', NULL)
---
	def register
		user = User.new(params[:user])

		if user.valid?
			update_authentication_token(user, params[:user][:remember_me])
			user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
	def sign_out
		user = User.find_by_id(session[:user_id])